OpenFOAM-7/tutorials/multiphase/interFoam/RAS/mixerVesselAMI/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 125000;

boundaryField
{
    vessel
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 125000;
    }
    oilInlet
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 125000;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 125000;
    }
    shaftRotating
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 125000;
    }
    shaft
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 125000;
    }
    sparger
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 125000;
    }
    stirrer
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 125000;
    }
    baffles
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 125000;
    }
    AMI1
    {
        type            cyclicAMI;
        value           uniform 0;
    }
    AMI2
    {
        type            cyclicAMI;
        value           uniform 0;
    }
}


// ************************************************************************* //
